Tekla Open API Reference for Tekla Structures 2025
RebarSplice.RebarGroup1 Property
 The first one of the joined reinforcements (picked first).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Reinforcement RebarGroup1 { get; set; }
Public Property RebarGroup1 As Reinforcement
	Get
	Set
Property Value
Type: Reinforcement
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace